tutorials/simulations/singleHole/P15kW_lambda120/01.BFER2.unsteady/0.orig/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 800.;

boundaryField
{
    leftSide
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    solid_to_fluid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixedOpenSMOKEpp;
        value           uniform 800.;
        Tnbr            T;
    }
}


// ************************************************************************* //
