tutorials/simulations/singleHole/P15kW_lambda120/01.BFER2.unsteady/constant/fluid/SparkModel
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SparkModel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

spark           off;
position        (0.2e-3  0.1e-3 0.5e-3);
time            0.01;
temperature     2400.;
duration        1e-4;
diameter        0.30e-3;

