tutorials/simulations/singleHole/P15kW_lambda120/01.BFER2.unsteady/system/blockMeshDict
/*---------------------------------------------------------------------------*\               
| =========                 |                                                 |                
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |                
|  \\    /   O peration     | Version:  1.0                                   |                
|   \\  /    A nd           | Web:      http://www.openfoam.org               |                
|    \\/     M anipulation  |                                                 |                
\*---------------------------------------------------------------------------*/                
                                        
FoamFile                                
{                                       
    version         2.0;                
    format          ascii;              
                                        
    root            "";               
    case            "";               
    instance        "";               
    local           "";               
                                        
    class           dictionary;         
    object          blockMeshDict;      
}          


convertToMeters 0.001;
halfAngle	2.5;
radHalfAngle    #calc "degToRad($halfAngle)";

H0     -1.60;
H1     -0.60;
H2      0.00;
H3     10.00;
H4     55.00;
H5     65.00;

r1   0.40;
x1   #calc "$r1*cos($radHalfAngle)";
y1p  #calc "$r1*sin($radHalfAngle)";
y1m  #calc "-1.*$r1*sin($radHalfAngle)";

r2   2.143;
x2   #calc "$r2*cos($radHalfAngle)";
y2p  #calc "$r2*sin($radHalfAngle)";
y2m  #calc "-1.*$r2*sin($radHalfAngle)";

r3   1.02;
x3   #calc "$r3*cos($radHalfAngle)";
y3p  #calc "$r3*sin($radHalfAngle)";
y3m  #calc "-1.*$r3*sin($radHalfAngle)";
                   
vertices                                
(                                       
   (0. 		0.  		$H1 )   // 0
   ($x1 	$y1m      	$H1 )   // 1
   ($x1 	$y1p    	$H1 )   // 2

   (0. 		0.  		$H2 )   // 3
   ($x1 	$y1m      	$H2 )   // 4
   ($x1 	$y1p    	$H2 )   // 5

   (0. 		0.  		$H3 )   // 6
   ($x1 	$y1m      	$H3 )   // 7
   ($x1 	$y1p    	$H3 )   // 8

   (0. 		0.  		$H4 )   // 9
   ($x3 	$y3m      	$H4 )   // 10
   ($x3 	$y3p    	$H4 )   // 11

   ($x2 	$y2m      	$H1 )   // 12
   ($x2 	$y2p    	$H1 )   // 13  

   ($x2 	$y2m      	$H2 )   // 14
   ($x2 	$y2p    	$H2 )   // 15  

   ($x2 	$y2m      	$H3 )   // 16
   ($x2 	$y2p    	$H3 )   // 17  

   ($x2 	$y2m      	$H4 )   // 18
   ($x2 	$y2p    	$H4 )   // 19

   (0. 		0.  		$H0 )   // 20
   ($x1 	$y1m      	$H0 )   // 21
   ($x1 	$y1p    	$H0 )   // 22

   ($x2 	$y2m      	$H0 )   // 23
   ($x2 	$y2p    	$H0 )   // 24 

   (0. 		0.  		$H5 )   // 25
   ($x3 	$y3m      	$H5 )   // 26
   ($x3 	$y3p    	$H5 )   // 27

   ($x2 	$y2m      	$H5 )   // 28
   ($x2 	$y2p    	$H5 )   // 29

);

Nax01   4;
Nax12   8;
Nax23  60;
Nax34  80;
Nax45  20;

Nrad01   8;
Nrad12  18;

gradAx01 0.5;
gradAx12 1.;
gradAx23 3.;
gradAx34 2.;
gradAx45 1.;

gradRad01 1.;
gradRad12 2.;

blocks
( 	
	hex (20 21 22 20 0 1 2 0)      fluid    ($Nrad01  1 $Nax01 )  simpleGrading   ($gradRad01  1.  $gradAx01)
	hex (21 23 24 22 1 12 13 2)    fluid    ($Nrad12  1 $Nax01 )  simpleGrading   ($gradRad12  1.  $gradAx01)

	hex (0 1 2 0 3 4 5 3)          fluid    ($Nrad01  1 $Nax12 )  simpleGrading   ($gradRad01  1.  $gradAx12)
	hex (3 4 5 3 6 7 8 6)          fluid    ($Nrad01  1 $Nax23 )  simpleGrading   ($gradRad01  1.  $gradAx23)
	hex (6 7 8 6 9 10 11 9)        fluid    ($Nrad01  1 $Nax34 )  simpleGrading   ($gradRad01  1.  $gradAx34)

	hex (1 12 13 2 4 14 15 5)      solid    ($Nrad12  1 $Nax12 )  simpleGrading   ($gradRad12  1.  $gradAx12)
	hex (4 14 15 5 7 16 17 8)      fluid    ($Nrad12  1 $Nax23 )  simpleGrading   ($gradRad12  1.  $gradAx23)
	hex (7 16 17 8 10 18 19 11)    fluid    ($Nrad12  1 $Nax34 )  simpleGrading   ($gradRad12  1.  $gradAx34)

	hex (9 10 11 9 25 26 27 25)    fluid    ($Nrad01  1 $Nax45 )  simpleGrading   ($gradRad01  1.  $gradAx45)
);
                                     
edges                                
(      
	arc 1 2     ( $r1 0 $H1)
	arc 4 5     ( $r1 0 $H2)
	arc 7 8     ( $r1 0 $H3)
	arc 10 11   ( $r3 0 $H4)
	arc 26 27   ( $r3 0 $H5)

	arc 12 13   ( $r2 0 $H1)
	arc 14 15   ( $r2 0 $H2)
	arc 16 17   ( $r2 0 $H3)  
	arc 18 19   ( $r2 0 $H4)

	arc 21 22   ( $r1 0 $H0)
	arc 23 24   ( $r2 0 $H0)
	
);     

boundary               
(
        inlet           
        {
            type patch;    
            faces
            (
                (20 22 21 20)
		(22 24 23 21)
            );
        }  
        outlet          
        {
            type patch;    
            faces
            (
		(25 26 27 25)
            );
        } 
	coldWall          
        {
            type patch;    
            faces
            (
		(11 10 18 19)
		(27 26 10 11)
            );
        }

        axis          
        {
            type empty;    
            faces
            (
               	(3 0 0 3)
		(6 3 3 6)
		(9 6 6 9)
		(0 20 20 0)
		(9 25 25 9)
            );
        } 
        leftSide          
        {
            type patch;    
            faces
            (
		(15 14 12 13)
		(17 16 14 15)
		(19 18 16 17)
		(13 12 23 24)
            );
        } 

	front          
        {
            type wedge;    
            faces
            (
                (10 9 6 7)
		(7 6 3 4)
		(4 3 0 1)
		(18 10 7 16)
		(16 7 4 14)
		(14 4 1 12)
		(1 0 20 21)
		(12 1 21 23)
		(25 9 10 26)
            );
        } 

	back       
        {
            type wedge;    
            faces
            (
                (2 0 3 5)
		(5 3 6 8)
		(8 6 9 11)
		(15 5 8 17)
		(17 8 11 19)
		(13 2 5 15)
		(22 20 0 2)
		(24 22 2 13)
		(11 9 25 27)
            );
        }                                 
);                                   
                                     
mergePatchPairs                      
(                                    
);                                   

