tutorials/simulations/singleHole/P15kW_lambda120/01.BFER2.unsteady/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	laminarPimpleSMOKE++;

startFrom       	latestTime;

startTime       	0;

stopAt          	endTime;

endTime         	1;

deltaT          	1e-12;

writeControl    	adjustableRunTime;

writeInterval   	1e-4;

purgeWrite      	2;

writeFormat     	ascii;

writePrecision  	12;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	yes;

adjustTimeStep  	yes;

maxCo           	0.20;

fluid			on;
solid			on;

functions
{
        #include "FOintegrals"
}

