tutorials/simulations/singleHole/P15kW_lambda120/01.BFER2.unsteady/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver              PCGStab;
        preconditioner      DIC;
        tolerance           1e-7;
        relTol              0;
    };

    p
    {
        solver                GAMG;
        tolerance             1e-7;
        relTol                0.01;
        smoother              GaussSeidel;
        cacheAgglomeration    true;
        nCellsInCoarsestLevel 200;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    };

    pFinal
    {
        solver                GAMG;
        tolerance             1e-6;
        relTol                0;
        smoother              GaussSeidel;
        cacheAgglomeration    true;
        nCellsInCoarsestLevel 200;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    };

    "(U|T|mix:Hs)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
        nSweeps         1;
    }

    "(U|T|mix:Hs)Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
        nSweeps         1;
    }

    "Yi.*"
    {
        $TFinal;
    }

    "(G)Final"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-04;
        relTol          0;
    }

    csi
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
	minIter		1;
    }

    tau
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
	minIter		1;
    }

    "Ii.*"
    {
        solver              GAMG;
        tolerance           1e-5;
        relTol              0;
        smoother            symGaussSeidel;
        maxIter             10;
        nPostSweeps         1;
    }
}

PIMPLE
{
    momentumPredictor         yes;
    nOuterCorrectors          1;
    nCorrectors               2;
    nNonOrthogonalCorrectors  0;
}

// ************************************************************************* //
