tutorials/simulations/singleHole/P15kW_lambda120/01.BFER2.unsteady/system/fluid/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
);

// Initialize
regions
(

    // Inlet region 
    boxToCell
    {
        box (-1 -1 -1) (1 1 -0.3e-3);
        fieldValues
        (
            	volScalarFieldValue CH4  	0.046296296
            	volScalarFieldValue O2   	0.222222222
            	volScalarFieldValue N2   	0.731481482

		volScalarFieldValue CO2   	0.
		volScalarFieldValue H2O   	0.
        );
    }
         
    // Inlet region
    boxToCell
    {
        box (-1 -1 -1) (1 1 -0.3e-3);
        fieldValues
        (
            	volScalarFieldValue T   298.15
        );
    }

    // Top region
    boxToCell
    {
        box (-1 -1 30e-3) (1 1 1);
        fieldValues
        (
                volScalarFieldValue T   333.15
        );
    }
 
);



// ************************************************************************* //
