tutorials/simulations/singleHole/P15kW_lambda120/01.BFER2.unsteady/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solid";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default		Euler;
// 	default         steadyState;
}

gradSchemes
{
    default         	Gauss linear;
}

divSchemes
{
    default         	none;
}

laplacianSchemes
{
    default         	none;
    laplacian(alpha,h) 	Gauss linear corrected;
}

interpolationSchemes
{
    default         	linear;
}

snGradSchemes
{
    default         	corrected;
}

// ************************************************************************* //
